#### Handling Duplicate Values

In [1]:
import pandas as pd
data=pd.read_excel('company.xlsx')

In [2]:
print(data)

    EEID   Name  Gender    Salary
0  EMP01  Arhaan       M      NaN
1  EMP02   Dayam       M  25000.0
2  EMP01    Anam     NaN  27000.0
3  EMP04  Arhaan       M  20000.0
4  EMP05     NaN       F  25000.0
5  EMP06    Asif       M      NaN

In [3]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [4]:
data["EEID"].duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
Name: EEID, dtype: bool

In [5]:
data["EEID"].duplicated().sum()

np.int64(1)

In [6]:
data

    EEID   Name  Gender    Salary
0  EMP01  Arhaan       M      NaN
1  EMP02   Dayam       M  25000.0
2  EMP01    Anam     NaN  27000.0
3  EMP04  Arhaan       M  20000.0
4  EMP05     NaN       F  25000.0
5  EMP06    Asif       M      NaN

#### always select the column which has unique value 
#### drop the values using unique column
#### data.drop_duplicates("EEID)